IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_mem_cfg_regs.xml
<module id="MEM_CFG_REGS" HW_revision="" description="MEM CFG Registers">
	<register id="DxLOCK" width="32" page="1" offset="0x0" internal="0" description="Dedicated RAM Config Lock Register">
		<bitfield id="LOCK_M0" description="M0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_M1" description="M1 RAM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DxCOMMIT" width="32" page="1" offset="0x2" internal="0" description="Dedicated RAM Config Lock Commit Register">
		<bitfield id="COMMIT_M0" description="M0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_M1" description="M1 RAM Permanent Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DxTEST" width="32" page="1" offset="0x10" internal="0" description="Dedicated RAM TEST Register">
		<bitfield id="TEST_M0" description="Selects the different modes for M0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_M1" description="Selects the different modes for M1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="DxINIT" width="32" page="1" offset="0x12" internal="0" description="Dedicated RAM Init Register">
		<bitfield id="INIT_M0" description="RAM Initialization control for M0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_M1" description="RAM Initialization control for M1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DxINITDONE" width="32" page="1" offset="0x14" internal="0" description="Dedicated RAM InitDone Status Register">
		<bitfield id="INITDONE_M0" description="RAM Initialization status for M0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_M1" description="RAM Initialization status for M1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="DxRAMTEST_LOCK" width="32" page="1" offset="0x16" internal="0" description="Lock register to Dx RAM TEST registers">
		<bitfield id="M0" description="DxTEST.TEST_M0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="M1" description="DxTEST.TEST_M1 LOCK" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for writing DxRAMTEST_LOCK" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="LSxLOCK" width="32" page="1" offset="0x20" internal="0" description="Local Shared RAM Config Lock Register">
		<bitfield id="LOCK_LS4" description="LS4 RAM Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS5" description="LS5 RAM Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS6" description="LS6 RAM Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_LS7" description="LS7 RAM Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxCOMMIT" width="32" page="1" offset="0x22" internal="0" description="Local Shared RAM Config Lock Commit Register">
		<bitfield id="COMMIT_LS4" description="LS4 RAM Permanent Lock bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS5" description="LS5 RAM Permanent Lock bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS6" description="LS6 RAM Permanent Lock bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COMMIT_LS7" description="LS7 RAM Permanent Lock bits" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxACCPROT1" width="32" page="1" offset="0x2a" internal="0" description="Local Shared RAM Config Register 1">
		<bitfield id="FETCHPROT_LS4" description="Fetch Protection For LS4 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS4" description="CPU WR Protection For LS4 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS5" description="Fetch Protection For LS5 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS5" description="CPU WR Protection For LS5 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS6" description="Fetch Protection For LS6 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS6" description="CPU WR Protection For LS6 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS7" description="Fetch Protection For LS7 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS7" description="CPU WR Protection For LS7 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxTEST" width="32" page="1" offset="0x30" internal="0" description="Local Shared RAM TEST Register">
		<bitfield id="TEST_LS4" description="Selects the different modes for LS4 RAM" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS5" description="Selects the different modes for LS5 RAM" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS6" description="Selects the different modes for LS6 RAM" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS7" description="Selects the different modes for LS7 RAM" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="LSxINIT" width="32" page="1" offset="0x32" internal="0" description="Local Shared RAM Init Register">
		<bitfield id="INIT_LS4" description="RAM Initialization control for LS4 RAM." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS5" description="RAM Initialization control for LS5 RAM." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS6" description="RAM Initialization control for LS6 RAM." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS7" description="RAM Initialization control for LS7 RAM." begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxINITDONE" width="32" page="1" offset="0x34" internal="0" description="Local Shared RAM InitDone Status Register">
		<bitfield id="INITDONE_LS4" description="RAM Initialization status for LS4 RAM." begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS5" description="RAM Initialization status for LS5 RAM." begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS6" description="RAM Initialization status for LS6 RAM." begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS7" description="RAM Initialization status for LS7 RAM." begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="LSxRAMTEST_LOCK" width="32" page="1" offset="0x36" internal="0" description="Lock register to LSx RAM TEST registers">
		<bitfield id="LS4" description="LSxTEST.TEST_LS4 LOCK" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LS5" description="LSxTEST.TEST_LS5 LOCK" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LS6" description="LSxTEST.TEST_LS6 LOCK" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LS7" description="LSxTEST.TEST_LS7 LOCK" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to enable write to lock" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="GSxLOCK" width="32" page="1" offset="0x40" internal="0" description="Global Shared RAM Config Lock Register">
		<bitfield id="LOCK_GS0" description="GS0 RAM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxCOMMIT" width="32" page="1" offset="0x42" internal="0" description="Global Shared RAM Config Lock Commit Register">
		<bitfield id="COMMIT_GS0" description="GS0 RAM Permanent Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxACCPROT0" width="32" page="1" offset="0x48" internal="0" description="Global Shared RAM Config Register 0">
		<bitfield id="FETCHPROT_GS0" description="Fetch Protection For GS0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_GS0" description="CPU WR Protection For GS0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAWRPROT_GS0" description="DMA WR Protection For GS0 RAM" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HICWRPROT_GS0" description="HIC WR Protection For GS0 RAM" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxTEST" width="32" page="1" offset="0x50" internal="0" description="Global Shared RAM TEST Register">
		<bitfield id="TEST_GS0" description="Selects the different modes for GS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="GSxINIT" width="32" page="1" offset="0x52" internal="0" description="Global Shared RAM Init Register">
		<bitfield id="INIT_GS0" description="RAM Initialization control for GS0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="GSxINITDONE" width="32" page="1" offset="0x54" internal="0" description="Global Shared RAM InitDone Status Register">
		<bitfield id="INITDONE_GS0" description="RAM Initialization status for GS0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="GSxRAMTEST_LOCK" width="32" page="1" offset="0x56" internal="0" description="Lock register to GSx RAM TEST registers">
		<bitfield id="GS0" description="GSxTEST.TEST_GS0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to enable write to lock" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ROM_LOCK" width="32" page="1" offset="0xa0" internal="0" description="ROM Config Lock Register">
		<bitfield id="LOCK_BOOTROM" description="BOOTROM Lock bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LOCK_SECUREROM" description="SECUREROM Lock bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for writing ROM LOCK" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="ROM_TEST" width="32" page="1" offset="0xa2" internal="0" description="ROM  TEST Register">
		<bitfield id="TEST_BOOTROM" description="Selects the different modes for BOOTROM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_SECUREROM" description="Selects the different modes for SECUREROM" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="ROM_FORCE_ERROR" width="32" page="1" offset="0xa4" internal="0" description="ROM Force Error register">
		<bitfield id="FORCE_BOOTROM_ERROR" description="Force Bootrom Parity Error" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_SECUREROM_ERROR" description="Force SECUREROM Parity Error" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
